Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: In your test fixture class (say FooTest ), declare as static some member variables to hold the shared resources.
it_it: Nella classe della fixture (ad esempio FooTest ), si dichiarano come static alcune variabili membro per contenere le risorse condivise.

source: In your test fixture class (say `FooTest` ), declare as `static` some member variables to hold the shared resources.
it_it: Nella classe della fixture (ad esempio `FooTest`), si dichiarano come `static` alcune variabili membro per contenere le risorse condivise.

source: Including the flag --gtest_list_tests overrides all other flags and lists tests in the following format:
it_it: L'inclusione del flag --gtest_list_tests sovrascrive tutti gli altri flag ed elenca i test nel seguente formato:

source: Including the flag `--gtest_list_tests` overrides all other flags and lists tests in the following format:
it_it: L'inclusione del flag `--gtest_list_tests` sovrascrive tutti gli altri flag ed elenca i test nel seguente formato:

source: Indicates that the expectation will no longer be active after the expected number of matching function calls has been reached.
it_it: Indica che la expectation non sarà più attiva una volta raggiunto il numero previsto di chiamate di funzione corrispondenti.

source: Indices and tables
it_it: Indice e tabelle

source: Initializes GoogleTest.
it_it: Inizializza GoogleTest.

source: Initializes it via SetUp().
it_it: Lo inizializza tramite SetUp().

source: Initializes it via `SetUp()`.
it_it: Lo inizializza tramite `SetUp()`.

source: Inside the statements, you can refer to the K-th (0-based) argument of the mock function as argK.
it_it: All'interno delle istruzioni, si può fare riferimento all'argomento K-esimo (in base 0) della funzione mock come argK.

source: Inside the class, declare any objects you plan to use.
it_it: All'interno della classe, si dichiarano tutti gli oggetti che si intendono usare.

source: Inside the statements, you can refer to the value being matched by arg, and refer to its type by arg_type.
it_it: All'interno delle istruzioni, si può fare riferimento al valore a cui corrisponde arg e fare riferimento al suo tipo tramite arg_type.

source: Inside the statements, you can refer to the K-th (0-based) argument of the mock function as `argK`.
it_it: All'interno delle istruzioni, si può fare riferimento all'argomento K-esimo (in base 0) della funzione mock come `argK`.

source: Inside the statements, you can refer to the value being matched by `arg`, and refer to its type by `arg_type`.
it_it: All'interno delle istruzioni, si può fare riferimento al valore a cui corrisponde `arg` e fare riferimento al suo tipo tramite `arg_type`.

source: Install into the sysroot using DESTDIR:
it_it: Installare in sysroot con DESTDIR:

source: Install into the sysroot using `DESTDIR`:
it_it: Installare in sysroot con `DESTDIR`:

source: Instantiates the type-parameterized test suite *`TestSuiteName`*.
it_it: Crea un'istanza della test suite con tipi parametrizzati *`TestSuiteName`*.

source: Instantiates the type-parameterized test suite TestSuiteName.
it_it: Crea un'istanza della test suite con tipi parametrizzati TestSuiteName.

source: Instantiates the value-parameterized test suite *`TestSuiteName`* (defined with [`TEST_P`](#TEST_P)).
it_it: Crea un'istanza della test suite *`TestSuiteName`* con valori parametrizzati (definita con [`TEST_P`](#TEST_P)).

source: Instantiates the value-parameterized test suite TestSuiteName (defined with TEST_P).
it_it: Crea un'istanza della test suite TestSuiteName con valori parametrizzati (definita con TEST_P).

source: Instead of
it_it: Invece di

source: Instead of calling a free function (say, OpenFile) directly, introduce an interface for it and have a concrete subclass that calls the free function:
it_it: Invece di chiamare direttamente una funzione libera (ad esempio, OpenFile), se ne introduce un'interfaccia e si dispone una sottoclasse concreta che chiama la funzione libera:

source: Instead of calling a free function (say, `OpenFile`) directly, introduce an interface for it and have a concrete subclass that calls the free function:
it_it: Invece di chiamare direttamente una funzione libera (ad esempio, `OpenFile`), se ne introduce un'interfaccia e si dispone una sottoclasse concreta che chiama la funzione libera:

source: Instead of returning 100, 101, 102, ..., consecutively, this mock function will always return 100 as n++ is only evaluated once.
it_it: Invece di restituire 100, 101, 102, ..., consecutivamente, questa funzione mock restituirà sempre 100 in quanto n++ viene valutato solo una volta.

source: Instead of returning 100, 101, 102, ..., consecutively, this mock function will always return 100 as `n++` is only evaluated once.
it_it: Invece di restituire 100, 101, 102, ..., consecutivamente, questa funzione mock restituirà sempre 100 in quanto `n++` viene valutato solo una volta.

source: Instead, either call abort and crash the entire test executable, or put the fatal assertion in a SetUp/TearDown function; see constructor/destructor vs. SetUp/TearDown
it_it: Invece, o si chiama abort e si manda in crash tutto l'eseguibile del test, oppure si inserisce l'asserzione fatale in una funzione SetUp/TearDown; vedere constructor/destructor vs. SetUp/TearDown

source: Instead, either call `abort` and crash the entire test executable, or put the fatal assertion in a `SetUp`/`TearDown` function; see [constructor/destructor vs. `SetUp`/`TearDown`](faq.md#CtorVsSetUp)
it_it: Invece, o si chiama `abort` e si manda in crash tutto l'eseguibile del test, oppure si inserisce l'asserzione fatale in una funzione `SetUp`/`TearDown`; vedere [constructor/destructor vs. `SetUp`/`TearDown`](faq.md#CtorVsSetUp)

source: Instead, it only stops the current test and continues with the next.
it_it: Ma, interrompe solo il test corrente e continua col successivo.

source: Instead, the GoogleTest flag variables are updated.
it_it: Vengono invece aggiornate le variabili flag di GoogleTest.

source: Instead, we let the compiler infer the types for us.
it_it: Lasciamo invece che sia il compilatore a dedurre i tipi.

source: Instead, you can absorb the change in your implementation of the interface, and your other code and tests will be insulated from this change.
it_it: Al contrario, si possono assorbire le modifiche nell'implementazione dell'interfaccia e l'altro codice e gli altri test saranno isolati da queste modifiche.

source: Instead, you can define a FileOps interface and an IOOps interface and split System's functionalities into the two.
it_it: Si può invece definire un'interfaccia FileOps e un'interfaccia IOOps dividendo le funzionalità di System in due.

source: Instead, you can define a `FileOps` interface and an `IOOps` interface and split `System`'s functionalities into the two.
it_it: Si può invece definire un'interfaccia `FileOps e un'interfaccia `IOOps` dividendo le funzionalità di `System` in due.

source: Instead, you can define the test logic first and instantiate it with different type lists later.
it_it: È invece possibile definire prima la logica del test e istanziarla successivamente con elenchi di tipi diversi.

source: Instead, you may need to validate a certain member variable or the result of a certain getter method of the object.
it_it: Potrebbe invece essere necessario validare una determinata variabile membro o il risultato di un determinato metodo getter dell'oggetto.

source: Instead, you need:
it_it: Occorre, invece:

source: Introduction
it_it: Introduzione

source: Introduction: Why GoogleTest?
it_it: Introduzione: Perché GoogleTest?

source: Invoke f with the arguments passed to the mock function, where f can be a global/static function or a functor.
it_it: Invoca f con gli argomenti passati alla funzione mock, dove fpuò essere una funzione globale/statica o un funtore.

source: Invoke f with the arguments passed to the mock function, where f is a callable.
it_it: Invoca f con gli argomenti passati alla funzione mock, dove f è un "callable".

source: Invoke f, which can be a global/static function or a functor.
it_it: Invoca f, che può essere una funzione globale/statica o un funtore.

source: Invoke `f` with the arguments passed to the mock function, where `f` can be a global/static function or a functor.
it_it: Invoca `f` con gli argomenti passati alla funzione mock, dove `f` può essere una funzione globale/statica o un funtore.

source: Invoke `f` with the arguments passed to the mock function, where `f` is a callable.
it_it: Invoca `f` con gli argomenti passati alla funzione mock, dove `f` è un "callable".

source: Invoke `f`, which can be a global/static function or a functor.
it_it: Invoca `f`, che può essere una funzione globale/statica o un funtore.

source: Invoke the method on the object with the arguments passed to the mock function.
it_it: Invoca il metodo sull'oggetto con gli argomenti passati alla funzione mock.

source: Invoke the method on the object, which takes no arguments.
it_it: Invoca il metodo sull'oggetto, che non accetta argomenti.

source: Invoke the mock function's N-th (0-based) argument, which must be a function or a functor, with the k arguments.
it_it: Invoca l'argomento N-esimo (basato su 0) della funzione mock, che deve essere una funzione o un funtore, con gli argomenti k.

source: Invoke the mock function's `N`-th (0-based) argument, which must be a function or a functor, with the `k` arguments.
it_it: Invoca l'argomento `N`-esimo (basato su 0) della funzione mock, che deve essere una funzione o un funtore, con gli argomenti `k`.

source: Invoke(done) ...; // This won't compile!
it_it: Invoke(done) ...; // Questo non verrà compilato!

source: Invoke(done2) ...; // This works.
it_it: Invoke(done2) ...; // Questo funziona.

source: Invoke(implicit_cast<Closure*>(done)) ...; // The cast is necessary.
it_it: Invoke(implicit_cast<Closure*>(done)) ...; // Il cast è necessario.

source: Invoke(is_ok) ...; // This works.
it_it: Invoke(is_ok) ...; // Questo funziona.

source: InvokeWithoutArgs(is_ok) ...; // This works.
it_it: InvokeWithoutArgs(is_ok) ...; // Questo funziona.

source: Invoking a Function/Method/Functor/Lambda/Callback Without Arguments
it_it: Invcare una Funzione/Metodo/Funtore/Lambda/Callback Senza Argomenti

source: Invoking an Argument of the Mock Function
it_it: Invocare un Argomento della Funzione Mock

source: Invoking the Tests
it_it: Invocare i Test

source: Is Bound To
it_it: è [Bound] A

source: Is it OK if I have two separate TEST(Foo, Bar) test methods defined in different namespaces?
it_it: Va bene se ho due metodi di test TEST(Foo, Bar) separati definiti in namespace diversi?

source: Is it OK if I have two separate `TEST(Foo, Bar)` test methods defined in different namespaces?
it_it: Va bene se ho due metodi di test <`TEST(Foo, Bar)` separati definiti in namespace diversi?

source: Is it a gMock bug?
it_it: È un bug di gMock?

source: Is this a GoogleTest bug?
it_it: È un bug di GoogleTest?

source: Isn't this redundant?
it_it: Non è ridondante?

source: Isn't verification the whole point of tests?
it_it: La verifica non è il punto centrale dei test?

source: It casts a matcher m to type Matcher<T>.
it_it: Si effettua il cast di un matcher m nel tipo Matcher<T>.

source: It lacks many features.
it_it: Mancano molte funzionalità.

source: It must be derived from both testing::Test and testing::WithParamInterface<T> (the latter is a pure interface), where T is the type of your parameter values.
it_it: Deve essere derivata sia da testing::Test che da testing::WithParamInterface<T> (quest'ultima è un'interfaccia pura), dove T è il tipo dei valori parametrizzati.

source: It returns the value pointed to by pointer at the time the action is executed:
it_it: Restituisce il valore puntato da pointer nel momento in cui l'azione viene eseguita:

source: It works as long as the return value can be used as the condition in the statement if (condition) ....
it_it: Funziona fin quando il valore restituito può essere utilizzato come condizione nell'istruzione if (condizione) ....

source: It allows us to repeat an expectation many times without actually writing it as many times.
it_it: Consente di ripetere una expectation molte volte senza in realtà scriverla tante volte.

source: It also gives GoogleTest some wiggle room in case its implementation needs to change in the future.
it_it: Offre inoltre a GoogleTest un po' di margine di manovra nel caso in cui la sua implementazione debba cambiare in futuro.

source: It also has a AsStdFunction() method, which creates a std::function proxy forwarding to Call:
it_it: C'è anche il metodo AsStdFunction(), che crea un proxy std::function che inoltra a Call:

source: It also has a `AsStdFunction()` method, which creates a `std::function` proxy forwarding to Call:
it_it: C'è anche il metodo `AsStdFunction()`, che crea un proxy `std::function` che inoltra [forward] a Call:

source: It also works if MockFoo's constructor takes some arguments, as NiceMock<MockFoo> "inherits" MockFoo's constructors:
it_it: Funziona anche se il costruttore di MockFoo accetta alcuni argomenti, poiché NiceMock<MockFoo> "eredita" i costruttori di MockFoo:

source: It also works if `MockFoo`'s constructor takes some arguments, as `NiceMock<MockFoo>` "inherits" `MockFoo`'s constructors:
it_it: Funziona anche se il costruttore di `MockFoo` accetta alcuni argomenti, poiché `NiceMock<MockFoo>` "eredita" i costruttori di `MockFoo`:

source: It can (and should) reference the special bool variable negation, and should evaluate to the description of the matcher when negation is false, or that of the matcher's negation when negation is true.
it_it: Può (e dovrebbe) fare riferimento alla variabile bool speciale negation e dovrebbe valutare la descrizione del matcher quando negation è false, o quello della negazione del matcher quando negation è true.

source: It can (and should) reference the special `bool` variable `negation`, and should evaluate to the description of the matcher when `negation` is `false`, or that of the matcher's negation when `negation` is `true`.
it_it: Può (e dovrebbe) fare riferimento alla variabile `bool` speciale `negation` e dovrebbe valutare la descrizione del matcher quando `negation` è `false`, o quello della negazione del matcher quando `negation` è `true`.

source: It can be either const or not, but must be invocable with exactly one template argument, which is the result type.
it_it: Può essere const o meno, ma deve essere invocabile esattamente con un argomento template, che è il tipo del risultato.

source: It can be either `const` or not, but must be invocable with exactly one template argument, which is the result type.
it_it: Può essere `const` o meno, ma deve essere invocabile esattamente con un argomento template, che è il tipo del risultato.

source: It casts a matcher `m` to type `Matcher<T>`.
it_it: Si effettua il cast di un matcher `m` nel tipo `Matcher<T>`.

source: It copies the elements in source range [first, last) to the array pointed to by the N-th (0-based) argument:
it_it: Questa copia gli elementi nell'intervallo di origine [first, last) nell'array puntato dall'argomento N-esimo (in base 0):

source: It copies the elements in source range `[first, last)` to the array pointed to by the `N`-th (0-based) argument:
it_it: Questa copia gli elementi nell'intervallo di origine `[first, last)` nell'array puntato dall'argomento `N`-esimo (in base 0):

source: It could also increase the chance the action function can be reused.
it_it: Potrebbe anche aumentare la possibilità che la funzione dell'azione possa essere riutilizzata.

source: It creates an extension point where subclasses can tweak your class' behavior.
it_it: Si crea un punto di estensione in cui le sottoclassi possono modificare il comportamento della classe.

source: It does not work for std::string or C strings.
it_it: Non funziona con std::string né con stringhe C.

source: It does not work for `std::string` or C strings.
it_it: Non funziona con `std::string` né con stringhe C.

source: It does this using a user-extensible value printer.
it_it: Lo fa utilizzando una stampante con valori estensibile dall'utente.

source: It does to C++ what jMock/EasyMock does to Java (well, more or less).
it_it: Fa a C++ quello che jMock/EasyMock fa a Java (beh, più o meno).

source: It doesn't have to be exact.
it_it: Non deve essere esatta.

source: It fails: gMock tells you some expectations aren't satisfied.
it_it: Fallisce: gMock ti dice che alcune expectation non sono soddisfatte.

source: It handles ownership to the caller.
it_it: Gestisce la proprietà del chiamante.

source: It inherits from no other, but defines // GetPacket() and NumberOfPackets().
it_it: Non eredita da nessun altro, ma definisce // GetPacket() e NumberOfPackets().

source: It is a preferred way of passing callbacks to new interfaces.
it_it: È un modo preferito per passare le callback a nuove interfacce.

source: It is also possible to write your own matchers—see Writing New Matchers Quickly.
it_it: È anche possibile scrivere i propri matcher: vedere Scrivere Rapidamente Nuovi Matcher.

source: It is also possible to write your own matchers—see [Writing New Matchers Quickly](../gmock_cook_book.md#NewMatchers).
it_it: È anche possibile scrivere i propri matcher: vedere [Scrivere Rapidamente Nuovi Matcher](../gmock_cook_book.md#NewMatchers).

source: It is currently unsafe to use Google Test assertions from two threads concurrently on other systems (e.g. Windows).
it_it: Al momento è unsafe utilizzare le asserzioni di Google Test da due thread contemporaneamente su altri sistemi (ad esempio Windows).

source: It is currently *unsafe* to use Google Test assertions from two threads concurrently on other systems (e.g. Windows).
it_it: Al momento è *unsafe* utilizzare le asserzioni di Google Test da due thread contemporaneamente su altri sistemi (ad esempio Windows).

source: It is difficult to make EXPECT_EQ bypass the htonl() bug, as the solution must work with different compilers on various platforms.
it_it: È difficile fare in modo che EXPECT_EQ bypassi il bug htonl(), poiché la soluzione deve funzionare con diversi compilatori su varie piattaforme.

source: It is difficult to make `EXPECT_EQ` bypass the `htonl()` bug, as the solution must work with different compilers on various platforms.
it_it: È difficile fare in modo che `EXPECT_EQ` bypassi il bug `htonl()`, poiché la soluzione deve funzionare con diversi compilatori su varie piattaforme.

source: It is easy to confuse the term *fake objects* with mock objects.
it_it: È facile confondere il termine *oggetti fake* (falsi) con oggetto mock (simulati).

source: It is easy to confuse the term fake objects with mock objects.
it_it: È facile confondere il termine oggetti fake (falsi) con oggetto mock (simulati).

source: It is generally recommended that you use target_compile_options + _CFLAGS over target_include_directories + _INCLUDE_DIRS as the former includes not just -I flags (GoogleTest might require a macro indicating to internal headers that all libraries have been compiled with threading enabled.
it_it: In genere è consigliabile utilizzare target_compile_options + _CFLAGS su target_include_directories + _INCLUDE_DIRS poiché il primo include non solo i flag -I (GoogleTest potrebbe richiedere una macro che indichi agli header interni che tutte le librerie sono state compilate con il threading abilitato.

source: It is generally recommended that you use `target_compile_options` + `_CFLAGS` over `target_include_directories` + `_INCLUDE_DIRS` as the former includes not just -I flags (GoogleTest might require a macro indicating to internal headers that all libraries have been compiled with threading enabled.
it_it: In genere è consigliabile utilizzare `target_compile_options` + `_CFLAGS` su `target_include_directories` + `_INCLUDE_DIRS` poiché il primo include non solo i flag -I (GoogleTest potrebbe richiedere una macro che indichi agli header interni che tutte le librerie sono state compilate con il threading abilitato.

source: It is less chatty than the default mock, but otherwise is the same.
it_it: È meno loquace del mock di default, ma per il resto è lo stesso.

source: It is named
it_it: È chiamato

source: It is not possible to directly mock a free function (i.e. a C-style function or a static method).
it_it: Non è possibile avere direttamente mock di una funzione libera (ad esempio una funzione in stile C o un metodo statico).

source: It is typical to do some custom initialization work before executing a unit test.
it_it: In genere è necessario eseguire un lavoro di inizializzazione personalizzato prima di eseguire una unit test.

source: It is very possible that you get a failure along the lines of:
it_it: È molto probabile che si verifichi un problema sulla falsariga di:

source: It is your friend if any of the following problems is bothering you:
it_it: Risulta amichevole se uno qualsiasi dei seguenti problemi è un disturbo:

source: It just means that you were lucky.
it_it: Significa solo che si è stati fortunati.

source: It may seem fine for TestSuiteName and TestName to contain _ in the middle.
it_it: Potrebbe sembrare corretto che TestSuiteName e TestName contengano _ nel mezzo.

source: It may seem fine for `TestSuiteName` and `TestName` to contain `_` in the middle.
it_it: Potrebbe sembrare corretto che `TestSuiteName` e `TestName` contengano `_` nel mezzo.

source: It means that the container must have 4 elements, which (under some permutation) must be 1, greater than 0, anything, and 5 respectively.
it_it: Significa che il container deve avere 4 elementi, che (con qualche permutazione) devono essere rispettivamente 1, maggiore di 0, qualsiasi cosa e 5.

source: It must be derived from both `testing::Test` and `testing::WithParamInterface<T>` (the latter is a pure interface), where `T` is the type of your parameter values.
it_it: Deve essere derivata sia da `testing::Test` che da `testing::WithParamInterface<T>` (quest'ultima è un'interfaccia pura), dove `T` è il tipo dei valori parametrizzati.

source: It must be the same for all shards.
it_it: Deve essere lo stesso per tutti gli shard.

source: It provides the following signature:
it_it: Fornisce la seguente firma [signature]:

source: It returns 0 if all tests are successful, or 1 otherwise.
it_it: Restituisce 0se tutti i test hanno esito positivo, altrimenti 1.

source: It returns `0` if all tests are successful, or `1` otherwise.
it_it: Restituisce `0` se tutti i test hanno esito positivo, altrimenti `1`.

source: It returns the value pointed to by `pointer` at the time the action is *executed*:
it_it: Restituisce il valore puntato da `pointer` nel momento in cui l'azione viene *eseguita*:

source: It should be parameterized by a type.
it_it: Dovrebbe essere parametrizzata da un tipo.

source: It then becomes the caller's responsibility to delete the listener.
it_it: Diventa quindi responsabilità del chiamante eliminarlo.

source: It trades increased test execution time (potentially dramatically so) for improved thread safety.
it_it: Scambia un aumento del tempo di esecuzione del test (potenzialmente in modo drammatico) con una migliore sicurezza del thread.

source: It uses clone() instead of fork() to spawn the child process on Linux (clone() is not available on Cygwin and Mac), as fork() is more likely to cause the child to hang when the parent process has multiple threads.
it_it: Usa clone() invece di fork() per lo spawn del processo figlio su Linux (clone() non è disponibile su Cygwin né su Mac), in quanto fork() è più probabile che causi il blocco [hang] del figlio quando il processo genitore ha più thread.
